---
kind: method
id: M:Autodesk.Revit.DB.ScheduleFieldId.#ctor(System.Int32)
source: html/8d481134-d876-0941-881a-58517a3cd7ad.htm
---
# Autodesk.Revit.DB.ScheduleFieldId.#ctor Method

Initializes a new instance of the ScheduleFieldId class

## Syntax (C#)
```csharp
public ScheduleFieldId(
	int id
)
```

## Parameters
- **id** (`System.Int32`)